tuya/tuya-iotos-embeded-sdk-wifi-ble-bk7231n/platforms/bk7231n/bk7231n_os/beken378/driver/ble/ble_pub/plf/refip/src/build/ble_full/reg/fw/reg_blecore.h
// field definitions
#define BLE_EVT_CNT_OFFSETU0_MASK   ((uint32_t)0x0000007F)
#define BLE_EVT_CNT_OFFSETU0_LSB    0
#define BLE_EVT_CNT_OFFSETU0_WIDTH  ((uint32_t)0x00000007)

#define BLE_EVT_CNT_OFFSETU0_RST    0x0

__INLINE uint8_t ble_evt_cnt_offsetu0_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOEVTCNTOFFSETU0_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000007F)) == 0);
    return (localVal >> 0);
}

__INLINE void ble_evt_cnt_offsetu0_setf(uint8_t evtcntoffsetu0)
{
    ASSERT_ERR((((uint32_t)evtcntoffsetu0 << 0) & ~((uint32_t)0x0000007F)) == 0);
    REG_BLE_WR(BLE_ISOEVTCNTOFFSETU0_ADDR, (uint32_t)evtcntoffsetu0 << 0);
}

/**
 * @brief ISOCHANCNTL1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     04           RETXACKEN1   0
 *     03             SYNCGEN1   0
 *     02           ISOCHANEN1   0
 *  01:00             ISOTYPE1   0x0
 * </pre>
 */
#define BLE_ISOCHANCNTL1_ADDR   0x00810170
#define BLE_ISOCHANCNTL1_OFFSET 0x00000170
#define BLE_ISOCHANCNTL1_INDEX  0x0000005C
#define BLE_ISOCHANCNTL1_RESET  0x00000000

__INLINE uint32_t ble_isochancntl1_get(void)
{
    return REG_BLE_RD(BLE_ISOCHANCNTL1_ADDR);
}

__INLINE void ble_isochancntl1_set(uint32_t value)
{
    REG_BLE_WR(BLE_ISOCHANCNTL1_ADDR, value);
}

// field definitions
#define BLE_RETXACKEN1_BIT    ((uint32_t)0x00000010)
#define BLE_RETXACKEN1_POS    4
#define BLE_SYNCGEN1_BIT      ((uint32_t)0x00000008)
#define BLE_SYNCGEN1_POS      3
#define BLE_ISOCHANEN1_BIT    ((uint32_t)0x00000004)
#define BLE_ISOCHANEN1_POS    2
#define BLE_ISOTYPE1_MASK     ((uint32_t)0x00000003)
#define BLE_ISOTYPE1_LSB      0
#define BLE_ISOTYPE1_WIDTH    ((uint32_t)0x00000002)

#define BLE_RETXACKEN1_RST    0x0
#define BLE_SYNCGEN1_RST      0x0
#define BLE_ISOCHANEN1_RST    0x0
#define BLE_ISOTYPE1_RST      0x0

__INLINE void ble_isochancntl1_pack(uint8_t retxacken1, uint8_t syncgen1, uint8_t isochanen1, uint8_t isotype1)
{
    ASSERT_ERR((((uint32_t)retxacken1 << 4) & ~((uint32_t)0x00000010)) == 0);
    ASSERT_ERR((((uint32_t)syncgen1 << 3) & ~((uint32_t)0x00000008)) == 0);
    ASSERT_ERR((((uint32_t)isochanen1 << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)isotype1 << 0) & ~((uint32_t)0x00000003)) == 0);
    REG_BLE_WR(BLE_ISOCHANCNTL1_ADDR,  ((uint32_t)retxacken1 << 4) | ((uint32_t)syncgen1 << 3) | ((uint32_t)isochanen1 << 2) | ((uint32_t)isotype1 << 0));
}

__INLINE void ble_isochancntl1_unpack(uint8_t* retxacken1, uint8_t* syncgen1, uint8_t* isochanen1, uint8_t* isotype1)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCHANCNTL1_ADDR);

    *retxacken1 = (localVal & ((uint32_t)0x00000010)) >> 4;
    *syncgen1 = (localVal & ((uint32_t)0x00000008)) >> 3;
    *isochanen1 = (localVal & ((uint32_t)0x00000004)) >> 2;
    *isotype1 = (localVal & ((uint32_t)0x00000003)) >> 0;
}

__INLINE uint8_t ble_retxacken1_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCHANCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__INLINE void ble_retxacken1_setf(uint8_t retxacken1)
{
    ASSERT_ERR((((uint32_t)retxacken1 << 4) & ~((uint32_t)0x00000010)) == 0);
    REG_BLE_WR(BLE_ISOCHANCNTL1_ADDR, (REG_BLE_RD(BLE_ISOCHANCNTL1_ADDR) & ~((uint32_t)0x00000010)) | ((uint32_t)retxacken1 << 4));
}

__INLINE uint8_t ble_syncgen1_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCHANCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__INLINE void ble_syncgen1_setf(uint8_t syncgen1)
{
    ASSERT_ERR((((uint32_t)syncgen1 << 3) & ~((uint32_t)0x00000008)) == 0);
    REG_BLE_WR(BLE_ISOCHANCNTL1_ADDR, (REG_BLE_RD(BLE_ISOCHANCNTL1_ADDR) & ~((uint32_t)0x00000008)) | ((uint32_t)syncgen1 << 3));
}

__INLINE uint8_t ble_isochanen1_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCHANCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__INLINE void ble_isochanen1_setf(uint8_t isochanen1)
{
    ASSERT_ERR((((uint32_t)isochanen1 << 2) & ~((uint32_t)0x00000004)) == 0);
    REG_BLE_WR(BLE_ISOCHANCNTL1_ADDR, (REG_BLE_RD(BLE_ISOCHANCNTL1_ADDR) & ~((uint32_t)0x00000004)) | ((uint32_t)isochanen1 << 2));
}

__INLINE uint8_t ble_isotype1_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCHANCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00000003)) >> 0);
}

__INLINE void ble_isotype1_setf(uint8_t isotype1)
{
    ASSERT_ERR((((uint32_t)isotype1 << 0) & ~((uint32_t)0x00000003)) == 0);
    REG_BLE_WR(BLE_ISOCHANCNTL1_ADDR, (REG_BLE_RD(BLE_ISOCHANCNTL1_ADDR) & ~((uint32_t)0x00000003)) | ((uint32_t)isotype1 << 0));
}

/**
 * @brief ISOMUTECNTL1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31                 TOG1   0
 *     19           MUTE_SINK1   0
 *     18         MUTE_SOURCE1   0
 *     17              INVL1_1   1
 *     16              INVL1_0   1
 *  07:00        MUTE_PATTERN1   0x0
 * </pre>
 */
#define BLE_ISOMUTECNTL1_ADDR   0x00810174
#define BLE_ISOMUTECNTL1_OFFSET 0x00000174
#define BLE_ISOMUTECNTL1_INDEX  0x0000005D
#define BLE_ISOMUTECNTL1_RESET  0x00030000

__INLINE uint32_t ble_isomutecntl1_get(void)
{
    return REG_BLE_RD(BLE_ISOMUTECNTL1_ADDR);
}

__INLINE void ble_isomutecntl1_set(uint32_t value)
{
    REG_BLE_WR(BLE_ISOMUTECNTL1_ADDR, value);
}

// field definitions
#define BLE_TOG1_BIT             ((uint32_t)0x80000000)
#define BLE_TOG1_POS             31
#define BLE_MUTE_SINK1_BIT       ((uint32_t)0x00080000)
#define BLE_MUTE_SINK1_POS       19
#define BLE_MUTE_SOURCE1_BIT     ((uint32_t)0x00040000)
#define BLE_MUTE_SOURCE1_POS     18
#define BLE_INVL1_1_BIT          ((uint32_t)0x00020000)
#define BLE_INVL1_1_POS          17
#define BLE_INVL1_0_BIT          ((uint32_t)0x00010000)
#define BLE_INVL1_0_POS          16
#define BLE_MUTE_PATTERN1_MASK   ((uint32_t)0x000000FF)
#define BLE_MUTE_PATTERN1_LSB    0
#define BLE_MUTE_PATTERN1_WIDTH  ((uint32_t)0x00000008)

#define BLE_TOG1_RST             0x0
#define BLE_MUTE_SINK1_RST       0x0
#define BLE_MUTE_SOURCE1_RST     0x0
#define BLE_INVL1_1_RST          0x1
#define BLE_INVL1_0_RST          0x1
#define BLE_MUTE_PATTERN1_RST    0x0

