tuya/tuya-iotos-embeded-sdk-wifi-ble-bk7231n/platforms/bk7231n/bk7231n_os/beken378/driver/ble/ble_pub/plf/refip/src/build/ble_full/reg/fw/reg_blecore.h
__INLINE void ble_isomutecntl1_pack(uint8_t mutesink1, uint8_t mutesource1, uint8_t invl11, uint8_t invl10, uint8_t mutepattern1)
{
    ASSERT_ERR((((uint32_t)mutesink1 << 19) & ~((uint32_t)0x00080000)) == 0);
    ASSERT_ERR((((uint32_t)mutesource1 << 18) & ~((uint32_t)0x00040000)) == 0);
    ASSERT_ERR((((uint32_t)invl11 << 17) & ~((uint32_t)0x00020000)) == 0);
    ASSERT_ERR((((uint32_t)invl10 << 16) & ~((uint32_t)0x00010000)) == 0);
    ASSERT_ERR((((uint32_t)mutepattern1 << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_BLE_WR(BLE_ISOMUTECNTL1_ADDR,  ((uint32_t)mutesink1 << 19) | ((uint32_t)mutesource1 << 18) | ((uint32_t)invl11 << 17) | ((uint32_t)invl10 << 16) | ((uint32_t)mutepattern1 << 0));
}

__INLINE void ble_isomutecntl1_unpack(uint8_t* tog1, uint8_t* mutesink1, uint8_t* mutesource1, uint8_t* invl11, uint8_t* invl10, uint8_t* mutepattern1)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOMUTECNTL1_ADDR);

    *tog1 = (localVal & ((uint32_t)0x80000000)) >> 31;
    *mutesink1 = (localVal & ((uint32_t)0x00080000)) >> 19;
    *mutesource1 = (localVal & ((uint32_t)0x00040000)) >> 18;
    *invl11 = (localVal & ((uint32_t)0x00020000)) >> 17;
    *invl10 = (localVal & ((uint32_t)0x00010000)) >> 16;
    *mutepattern1 = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t ble_tog1_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOMUTECNTL1_ADDR);
    return ((localVal & ((uint32_t)0x80000000)) >> 31);
}

__INLINE uint8_t ble_mute_sink1_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOMUTECNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00080000)) >> 19);
}

__INLINE void ble_mute_sink1_setf(uint8_t mutesink1)
{
    ASSERT_ERR((((uint32_t)mutesink1 << 19) & ~((uint32_t)0x00080000)) == 0);
    REG_BLE_WR(BLE_ISOMUTECNTL1_ADDR, (REG_BLE_RD(BLE_ISOMUTECNTL1_ADDR) & ~((uint32_t)0x00080000)) | ((uint32_t)mutesink1 << 19));
}

__INLINE uint8_t ble_mute_source1_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOMUTECNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00040000)) >> 18);
}

__INLINE void ble_mute_source1_setf(uint8_t mutesource1)
{
    ASSERT_ERR((((uint32_t)mutesource1 << 18) & ~((uint32_t)0x00040000)) == 0);
    REG_BLE_WR(BLE_ISOMUTECNTL1_ADDR, (REG_BLE_RD(BLE_ISOMUTECNTL1_ADDR) & ~((uint32_t)0x00040000)) | ((uint32_t)mutesource1 << 18));
}

__INLINE uint8_t ble_invl1_1_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOMUTECNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00020000)) >> 17);
}

__INLINE void ble_invl1_1_setf(uint8_t invl11)
{
    ASSERT_ERR((((uint32_t)invl11 << 17) & ~((uint32_t)0x00020000)) == 0);
    REG_BLE_WR(BLE_ISOMUTECNTL1_ADDR, (REG_BLE_RD(BLE_ISOMUTECNTL1_ADDR) & ~((uint32_t)0x00020000)) | ((uint32_t)invl11 << 17));
}

__INLINE uint8_t ble_invl1_0_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOMUTECNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00010000)) >> 16);
}

__INLINE void ble_invl1_0_setf(uint8_t invl10)
{
    ASSERT_ERR((((uint32_t)invl10 << 16) & ~((uint32_t)0x00010000)) == 0);
    REG_BLE_WR(BLE_ISOMUTECNTL1_ADDR, (REG_BLE_RD(BLE_ISOMUTECNTL1_ADDR) & ~((uint32_t)0x00010000)) | ((uint32_t)invl10 << 16));
}

__INLINE uint8_t ble_mute_pattern1_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOMUTECNTL1_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void ble_mute_pattern1_setf(uint8_t mutepattern1)
{
    ASSERT_ERR((((uint32_t)mutepattern1 << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_BLE_WR(BLE_ISOMUTECNTL1_ADDR, (REG_BLE_RD(BLE_ISOMUTECNTL1_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)mutepattern1 << 0));
}

/**
 * @brief ISOCURRENTTXPTR1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:16           ISO1TXPTR1   0x0
 *  15:00           ISO1TXPTR0   0x0
 * </pre>
 */
#define BLE_ISOCURRENTTXPTR1_ADDR   0x00810178
#define BLE_ISOCURRENTTXPTR1_OFFSET 0x00000178
#define BLE_ISOCURRENTTXPTR1_INDEX  0x0000005E
#define BLE_ISOCURRENTTXPTR1_RESET  0x00000000

__INLINE uint32_t ble_isocurrenttxptr1_get(void)
{
    return REG_BLE_RD(BLE_ISOCURRENTTXPTR1_ADDR);
}

__INLINE void ble_isocurrenttxptr1_set(uint32_t value)
{
    REG_BLE_WR(BLE_ISOCURRENTTXPTR1_ADDR, value);
}

// field definitions
#define BLE_ISO1TXPTR1_MASK   ((uint32_t)0xFFFF0000)
#define BLE_ISO1TXPTR1_LSB    16
#define BLE_ISO1TXPTR1_WIDTH  ((uint32_t)0x00000010)
#define BLE_ISO1TXPTR0_MASK   ((uint32_t)0x0000FFFF)
#define BLE_ISO1TXPTR0_LSB    0
#define BLE_ISO1TXPTR0_WIDTH  ((uint32_t)0x00000010)

#define BLE_ISO1TXPTR1_RST    0x0
#define BLE_ISO1TXPTR0_RST    0x0

__INLINE void ble_isocurrenttxptr1_pack(uint16_t iso1txptr1, uint16_t iso1txptr0)
{
    ASSERT_ERR((((uint32_t)iso1txptr1 << 16) & ~((uint32_t)0xFFFF0000)) == 0);
    ASSERT_ERR((((uint32_t)iso1txptr0 << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_BLE_WR(BLE_ISOCURRENTTXPTR1_ADDR,  ((uint32_t)iso1txptr1 << 16) | ((uint32_t)iso1txptr0 << 0));
}

__INLINE void ble_isocurrenttxptr1_unpack(uint16_t* iso1txptr1, uint16_t* iso1txptr0)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCURRENTTXPTR1_ADDR);

    *iso1txptr1 = (localVal & ((uint32_t)0xFFFF0000)) >> 16;
    *iso1txptr0 = (localVal & ((uint32_t)0x0000FFFF)) >> 0;
}

__INLINE uint16_t ble_iso1txptr1_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCURRENTTXPTR1_ADDR);
    return ((localVal & ((uint32_t)0xFFFF0000)) >> 16);
}

__INLINE void ble_iso1txptr1_setf(uint16_t iso1txptr1)
{
    ASSERT_ERR((((uint32_t)iso1txptr1 << 16) & ~((uint32_t)0xFFFF0000)) == 0);
    REG_BLE_WR(BLE_ISOCURRENTTXPTR1_ADDR, (REG_BLE_RD(BLE_ISOCURRENTTXPTR1_ADDR) & ~((uint32_t)0xFFFF0000)) | ((uint32_t)iso1txptr1 << 16));
}

__INLINE uint16_t ble_iso1txptr0_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCURRENTTXPTR1_ADDR);
    return ((localVal & ((uint32_t)0x0000FFFF)) >> 0);
}

__INLINE void ble_iso1txptr0_setf(uint16_t iso1txptr0)
{
    ASSERT_ERR((((uint32_t)iso1txptr0 << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_BLE_WR(BLE_ISOCURRENTTXPTR1_ADDR, (REG_BLE_RD(BLE_ISOCURRENTTXPTR1_ADDR) & ~((uint32_t)0x0000FFFF)) | ((uint32_t)iso1txptr0 << 0));
}

/**
 * @brief ISOCURRENTRXPTR1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:16           ISO1RXPTR1   0x0
 *  15:00           ISO1RXPTR0   0x0
 * </pre>
 */
#define BLE_ISOCURRENTRXPTR1_ADDR   0x0081017C
#define BLE_ISOCURRENTRXPTR1_OFFSET 0x0000017C
#define BLE_ISOCURRENTRXPTR1_INDEX  0x0000005F
#define BLE_ISOCURRENTRXPTR1_RESET  0x00000000

__INLINE uint32_t ble_isocurrentrxptr1_get(void)
{
    return REG_BLE_RD(BLE_ISOCURRENTRXPTR1_ADDR);
}

__INLINE void ble_isocurrentrxptr1_set(uint32_t value)
{
    REG_BLE_WR(BLE_ISOCURRENTRXPTR1_ADDR, value);
}

