tuya/tuya-iotos-embeded-sdk-wifi-ble-bk7231n/platforms/bk7231n/bk7231n_os/beken378/driver/ble/ble_pub/plf/refip/src/build/ble_full/reg/fw/reg_blecore.h
// field definitions
#define BLE_ISO1RXPTR1_MASK   ((uint32_t)0xFFFF0000)
#define BLE_ISO1RXPTR1_LSB    16
#define BLE_ISO1RXPTR1_WIDTH  ((uint32_t)0x00000010)
#define BLE_ISO1RXPTR0_MASK   ((uint32_t)0x0000FFFF)
#define BLE_ISO1RXPTR0_LSB    0
#define BLE_ISO1RXPTR0_WIDTH  ((uint32_t)0x00000010)

#define BLE_ISO1RXPTR1_RST    0x0
#define BLE_ISO1RXPTR0_RST    0x0

__INLINE void ble_isocurrentrxptr1_pack(uint16_t iso1rxptr1, uint16_t iso1rxptr0)
{
    ASSERT_ERR((((uint32_t)iso1rxptr1 << 16) & ~((uint32_t)0xFFFF0000)) == 0);
    ASSERT_ERR((((uint32_t)iso1rxptr0 << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_BLE_WR(BLE_ISOCURRENTRXPTR1_ADDR,  ((uint32_t)iso1rxptr1 << 16) | ((uint32_t)iso1rxptr0 << 0));
}

__INLINE void ble_isocurrentrxptr1_unpack(uint16_t* iso1rxptr1, uint16_t* iso1rxptr0)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCURRENTRXPTR1_ADDR);

    *iso1rxptr1 = (localVal & ((uint32_t)0xFFFF0000)) >> 16;
    *iso1rxptr0 = (localVal & ((uint32_t)0x0000FFFF)) >> 0;
}

__INLINE uint16_t ble_iso1rxptr1_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCURRENTRXPTR1_ADDR);
    return ((localVal & ((uint32_t)0xFFFF0000)) >> 16);
}

__INLINE void ble_iso1rxptr1_setf(uint16_t iso1rxptr1)
{
    ASSERT_ERR((((uint32_t)iso1rxptr1 << 16) & ~((uint32_t)0xFFFF0000)) == 0);
    REG_BLE_WR(BLE_ISOCURRENTRXPTR1_ADDR, (REG_BLE_RD(BLE_ISOCURRENTRXPTR1_ADDR) & ~((uint32_t)0xFFFF0000)) | ((uint32_t)iso1rxptr1 << 16));
}

__INLINE uint16_t ble_iso1rxptr0_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCURRENTRXPTR1_ADDR);
    return ((localVal & ((uint32_t)0x0000FFFF)) >> 0);
}

__INLINE void ble_iso1rxptr0_setf(uint16_t iso1rxptr0)
{
    ASSERT_ERR((((uint32_t)iso1rxptr0 << 0) & ~((uint32_t)0x0000FFFF)) == 0);
    REG_BLE_WR(BLE_ISOCURRENTRXPTR1_ADDR, (REG_BLE_RD(BLE_ISOCURRENTRXPTR1_ADDR) & ~((uint32_t)0x0000FFFF)) | ((uint32_t)iso1rxptr0 << 0));
}

/**
 * @brief ISOTRCNTL1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  23:16            ISO1RXLEN   0x0
 *  07:00            ISO1TXLEN   0x0
 * </pre>
 */
#define BLE_ISOTRCNTL1_ADDR   0x00810180
#define BLE_ISOTRCNTL1_OFFSET 0x00000180
#define BLE_ISOTRCNTL1_INDEX  0x00000060
#define BLE_ISOTRCNTL1_RESET  0x00000000

__INLINE uint32_t ble_isotrcntl1_get(void)
{
    return REG_BLE_RD(BLE_ISOTRCNTL1_ADDR);
}

__INLINE void ble_isotrcntl1_set(uint32_t value)
{
    REG_BLE_WR(BLE_ISOTRCNTL1_ADDR, value);
}

// field definitions
#define BLE_ISO1RXLEN_MASK   ((uint32_t)0x00FF0000)
#define BLE_ISO1RXLEN_LSB    16
#define BLE_ISO1RXLEN_WIDTH  ((uint32_t)0x00000008)
#define BLE_ISO1TXLEN_MASK   ((uint32_t)0x000000FF)
#define BLE_ISO1TXLEN_LSB    0
#define BLE_ISO1TXLEN_WIDTH  ((uint32_t)0x00000008)

#define BLE_ISO1RXLEN_RST    0x0
#define BLE_ISO1TXLEN_RST    0x0

__INLINE void ble_isotrcntl1_pack(uint8_t iso1rxlen, uint8_t iso1txlen)
{
    ASSERT_ERR((((uint32_t)iso1rxlen << 16) & ~((uint32_t)0x00FF0000)) == 0);
    ASSERT_ERR((((uint32_t)iso1txlen << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_BLE_WR(BLE_ISOTRCNTL1_ADDR,  ((uint32_t)iso1rxlen << 16) | ((uint32_t)iso1txlen << 0));
}

__INLINE void ble_isotrcntl1_unpack(uint8_t* iso1rxlen, uint8_t* iso1txlen)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOTRCNTL1_ADDR);

    *iso1rxlen = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *iso1txlen = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t ble_iso1rxlen_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOTRCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

__INLINE void ble_iso1rxlen_setf(uint8_t iso1rxlen)
{
    ASSERT_ERR((((uint32_t)iso1rxlen << 16) & ~((uint32_t)0x00FF0000)) == 0);
    REG_BLE_WR(BLE_ISOTRCNTL1_ADDR, (REG_BLE_RD(BLE_ISOTRCNTL1_ADDR) & ~((uint32_t)0x00FF0000)) | ((uint32_t)iso1rxlen << 16));
}

__INLINE uint8_t ble_iso1txlen_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOTRCNTL1_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void ble_iso1txlen_setf(uint8_t iso1txlen)
{
    ASSERT_ERR((((uint32_t)iso1txlen << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_BLE_WR(BLE_ISOTRCNTL1_ADDR, (REG_BLE_RD(BLE_ISOTRCNTL1_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)iso1txlen << 0));
}

/**
 * @brief ISOEVTCNTOFFSETL1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00     EVT_CNT_OFFSETL1   0x0
 * </pre>
 */
#define BLE_ISOEVTCNTOFFSETL1_ADDR   0x00810184
#define BLE_ISOEVTCNTOFFSETL1_OFFSET 0x00000184
#define BLE_ISOEVTCNTOFFSETL1_INDEX  0x00000061
#define BLE_ISOEVTCNTOFFSETL1_RESET  0x00000000

__INLINE uint32_t ble_isoevtcntoffsetl1_get(void)
{
    return REG_BLE_RD(BLE_ISOEVTCNTOFFSETL1_ADDR);
}

__INLINE void ble_isoevtcntoffsetl1_set(uint32_t value)
{
    REG_BLE_WR(BLE_ISOEVTCNTOFFSETL1_ADDR, value);
}

// field definitions
#define BLE_EVT_CNT_OFFSETL1_MASK   ((uint32_t)0xFFFFFFFF)
#define BLE_EVT_CNT_OFFSETL1_LSB    0
#define BLE_EVT_CNT_OFFSETL1_WIDTH  ((uint32_t)0x00000020)

#define BLE_EVT_CNT_OFFSETL1_RST    0x0

__INLINE uint32_t ble_evt_cnt_offsetl1_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOEVTCNTOFFSETL1_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void ble_evt_cnt_offsetl1_setf(uint32_t evtcntoffsetl1)
{
    ASSERT_ERR((((uint32_t)evtcntoffsetl1 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_BLE_WR(BLE_ISOEVTCNTOFFSETL1_ADDR, (uint32_t)evtcntoffsetl1 << 0);
}

/**
 * @brief ISOEVTCNTOFFSETU1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  06:00     EVT_CNT_OFFSETU1   0x0
 * </pre>
 */
#define BLE_ISOEVTCNTOFFSETU1_ADDR   0x00810188
#define BLE_ISOEVTCNTOFFSETU1_OFFSET 0x00000188
#define BLE_ISOEVTCNTOFFSETU1_INDEX  0x00000062
#define BLE_ISOEVTCNTOFFSETU1_RESET  0x00000000

__INLINE uint32_t ble_isoevtcntoffsetu1_get(void)
{
    return REG_BLE_RD(BLE_ISOEVTCNTOFFSETU1_ADDR);
}

__INLINE void ble_isoevtcntoffsetu1_set(uint32_t value)
{
    REG_BLE_WR(BLE_ISOEVTCNTOFFSETU1_ADDR, value);
}

