tuya/tuya-iotos-embeded-sdk-wifi-ble-bk7231n/platforms/bk7231n/bk7231n_os/beken378/driver/ble/ble_pub/plf/refip/src/build/ble_full/reg/fw/reg_blecore.h
// field definitions
#define BLE_EVT_CNT_OFFSETU1_MASK   ((uint32_t)0x0000007F)
#define BLE_EVT_CNT_OFFSETU1_LSB    0
#define BLE_EVT_CNT_OFFSETU1_WIDTH  ((uint32_t)0x00000007)

#define BLE_EVT_CNT_OFFSETU1_RST    0x0

__INLINE uint8_t ble_evt_cnt_offsetu1_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOEVTCNTOFFSETU1_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000007F)) == 0);
    return (localVal >> 0);
}

__INLINE void ble_evt_cnt_offsetu1_setf(uint8_t evtcntoffsetu1)
{
    ASSERT_ERR((((uint32_t)evtcntoffsetu1 << 0) & ~((uint32_t)0x0000007F)) == 0);
    REG_BLE_WR(BLE_ISOEVTCNTOFFSETU1_ADDR, (uint32_t)evtcntoffsetu1 << 0);
}

/**
 * @brief ISOCHANCNTL2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     04           RETXACKEN2   0
 *     03             SYNCGEN2   0
 *     02           ISOCHANEN2   0
 *  01:00             ISOTYPE2   0x0
 * </pre>
 */
#define BLE_ISOCHANCNTL2_ADDR   0x00810190
#define BLE_ISOCHANCNTL2_OFFSET 0x00000190
#define BLE_ISOCHANCNTL2_INDEX  0x00000064
#define BLE_ISOCHANCNTL2_RESET  0x00000000

__INLINE uint32_t ble_isochancntl2_get(void)
{
    return REG_BLE_RD(BLE_ISOCHANCNTL2_ADDR);
}

__INLINE void ble_isochancntl2_set(uint32_t value)
{
    REG_BLE_WR(BLE_ISOCHANCNTL2_ADDR, value);
}

// field definitions
#define BLE_RETXACKEN2_BIT    ((uint32_t)0x00000010)
#define BLE_RETXACKEN2_POS    4
#define BLE_SYNCGEN2_BIT      ((uint32_t)0x00000008)
#define BLE_SYNCGEN2_POS      3
#define BLE_ISOCHANEN2_BIT    ((uint32_t)0x00000004)
#define BLE_ISOCHANEN2_POS    2
#define BLE_ISOTYPE2_MASK     ((uint32_t)0x00000003)
#define BLE_ISOTYPE2_LSB      0
#define BLE_ISOTYPE2_WIDTH    ((uint32_t)0x00000002)

#define BLE_RETXACKEN2_RST    0x0
#define BLE_SYNCGEN2_RST      0x0
#define BLE_ISOCHANEN2_RST    0x0
#define BLE_ISOTYPE2_RST      0x0

__INLINE void ble_isochancntl2_pack(uint8_t retxacken2, uint8_t syncgen2, uint8_t isochanen2, uint8_t isotype2)
{
    ASSERT_ERR((((uint32_t)retxacken2 << 4) & ~((uint32_t)0x00000010)) == 0);
    ASSERT_ERR((((uint32_t)syncgen2 << 3) & ~((uint32_t)0x00000008)) == 0);
    ASSERT_ERR((((uint32_t)isochanen2 << 2) & ~((uint32_t)0x00000004)) == 0);
    ASSERT_ERR((((uint32_t)isotype2 << 0) & ~((uint32_t)0x00000003)) == 0);
    REG_BLE_WR(BLE_ISOCHANCNTL2_ADDR,  ((uint32_t)retxacken2 << 4) | ((uint32_t)syncgen2 << 3) | ((uint32_t)isochanen2 << 2) | ((uint32_t)isotype2 << 0));
}

__INLINE void ble_isochancntl2_unpack(uint8_t* retxacken2, uint8_t* syncgen2, uint8_t* isochanen2, uint8_t* isotype2)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCHANCNTL2_ADDR);

    *retxacken2 = (localVal & ((uint32_t)0x00000010)) >> 4;
    *syncgen2 = (localVal & ((uint32_t)0x00000008)) >> 3;
    *isochanen2 = (localVal & ((uint32_t)0x00000004)) >> 2;
    *isotype2 = (localVal & ((uint32_t)0x00000003)) >> 0;
}

__INLINE uint8_t ble_retxacken2_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCHANCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00000010)) >> 4);
}

__INLINE void ble_retxacken2_setf(uint8_t retxacken2)
{
    ASSERT_ERR((((uint32_t)retxacken2 << 4) & ~((uint32_t)0x00000010)) == 0);
    REG_BLE_WR(BLE_ISOCHANCNTL2_ADDR, (REG_BLE_RD(BLE_ISOCHANCNTL2_ADDR) & ~((uint32_t)0x00000010)) | ((uint32_t)retxacken2 << 4));
}

__INLINE uint8_t ble_syncgen2_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCHANCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00000008)) >> 3);
}

__INLINE void ble_syncgen2_setf(uint8_t syncgen2)
{
    ASSERT_ERR((((uint32_t)syncgen2 << 3) & ~((uint32_t)0x00000008)) == 0);
    REG_BLE_WR(BLE_ISOCHANCNTL2_ADDR, (REG_BLE_RD(BLE_ISOCHANCNTL2_ADDR) & ~((uint32_t)0x00000008)) | ((uint32_t)syncgen2 << 3));
}

__INLINE uint8_t ble_isochanen2_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCHANCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00000004)) >> 2);
}

__INLINE void ble_isochanen2_setf(uint8_t isochanen2)
{
    ASSERT_ERR((((uint32_t)isochanen2 << 2) & ~((uint32_t)0x00000004)) == 0);
    REG_BLE_WR(BLE_ISOCHANCNTL2_ADDR, (REG_BLE_RD(BLE_ISOCHANCNTL2_ADDR) & ~((uint32_t)0x00000004)) | ((uint32_t)isochanen2 << 2));
}

__INLINE uint8_t ble_isotype2_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOCHANCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00000003)) >> 0);
}

__INLINE void ble_isotype2_setf(uint8_t isotype2)
{
    ASSERT_ERR((((uint32_t)isotype2 << 0) & ~((uint32_t)0x00000003)) == 0);
    REG_BLE_WR(BLE_ISOCHANCNTL2_ADDR, (REG_BLE_RD(BLE_ISOCHANCNTL2_ADDR) & ~((uint32_t)0x00000003)) | ((uint32_t)isotype2 << 0));
}

/**
 * @brief ISOMUTECNTL2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     31                 TOG2   0
 *     19           MUTE_SINK2   0
 *     18         MUTE_SOURCE2   0
 *     17              INVL2_1   1
 *     16              INVL2_0   1
 *  07:00        MUTE_PATTERN2   0x0
 * </pre>
 */
#define BLE_ISOMUTECNTL2_ADDR   0x00810194
#define BLE_ISOMUTECNTL2_OFFSET 0x00000194
#define BLE_ISOMUTECNTL2_INDEX  0x00000065
#define BLE_ISOMUTECNTL2_RESET  0x00030000

__INLINE uint32_t ble_isomutecntl2_get(void)
{
    return REG_BLE_RD(BLE_ISOMUTECNTL2_ADDR);
}

__INLINE void ble_isomutecntl2_set(uint32_t value)
{
    REG_BLE_WR(BLE_ISOMUTECNTL2_ADDR, value);
}

// field definitions
#define BLE_TOG2_BIT             ((uint32_t)0x80000000)
#define BLE_TOG2_POS             31
#define BLE_MUTE_SINK2_BIT       ((uint32_t)0x00080000)
#define BLE_MUTE_SINK2_POS       19
#define BLE_MUTE_SOURCE2_BIT     ((uint32_t)0x00040000)
#define BLE_MUTE_SOURCE2_POS     18
#define BLE_INVL2_1_BIT          ((uint32_t)0x00020000)
#define BLE_INVL2_1_POS          17
#define BLE_INVL2_0_BIT          ((uint32_t)0x00010000)
#define BLE_INVL2_0_POS          16
#define BLE_MUTE_PATTERN2_MASK   ((uint32_t)0x000000FF)
#define BLE_MUTE_PATTERN2_LSB    0
#define BLE_MUTE_PATTERN2_WIDTH  ((uint32_t)0x00000008)

#define BLE_TOG2_RST             0x0
#define BLE_MUTE_SINK2_RST       0x0
#define BLE_MUTE_SOURCE2_RST     0x0
#define BLE_INVL2_1_RST          0x1
#define BLE_INVL2_0_RST          0x1
#define BLE_MUTE_PATTERN2_RST    0x0

__INLINE void ble_isomutecntl2_pack(uint8_t mutesink2, uint8_t mutesource2, uint8_t invl21, uint8_t invl20, uint8_t mutepattern2)
{
    ASSERT_ERR((((uint32_t)mutesink2 << 19) & ~((uint32_t)0x00080000)) == 0);
    ASSERT_ERR((((uint32_t)mutesource2 << 18) & ~((uint32_t)0x00040000)) == 0);
    ASSERT_ERR((((uint32_t)invl21 << 17) & ~((uint32_t)0x00020000)) == 0);
    ASSERT_ERR((((uint32_t)invl20 << 16) & ~((uint32_t)0x00010000)) == 0);
    ASSERT_ERR((((uint32_t)mutepattern2 << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_BLE_WR(BLE_ISOMUTECNTL2_ADDR,  ((uint32_t)mutesink2 << 19) | ((uint32_t)mutesource2 << 18) | ((uint32_t)invl21 << 17) | ((uint32_t)invl20 << 16) | ((uint32_t)mutepattern2 << 0));
}

__INLINE void ble_isomutecntl2_unpack(uint8_t* tog2, uint8_t* mutesink2, uint8_t* mutesource2, uint8_t* invl21, uint8_t* invl20, uint8_t* mutepattern2)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOMUTECNTL2_ADDR);

    *tog2 = (localVal & ((uint32_t)0x80000000)) >> 31;
    *mutesink2 = (localVal & ((uint32_t)0x00080000)) >> 19;
    *mutesource2 = (localVal & ((uint32_t)0x00040000)) >> 18;
    *invl21 = (localVal & ((uint32_t)0x00020000)) >> 17;
    *invl20 = (localVal & ((uint32_t)0x00010000)) >> 16;
    *mutepattern2 = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

