tuya/tuya-iotos-embeded-sdk-wifi-ble-bk7231n/platforms/bk7231n/bk7231n_os/beken378/driver/ble/ble_pub/plf/refip/src/build/ble_full/reg/fw/reg_blecore.h
// field definitions
#define BLE_ISO2RXLEN_MASK   ((uint32_t)0x00FF0000)
#define BLE_ISO2RXLEN_LSB    16
#define BLE_ISO2RXLEN_WIDTH  ((uint32_t)0x00000008)
#define BLE_ISO2TXLEN_MASK   ((uint32_t)0x000000FF)
#define BLE_ISO2TXLEN_LSB    0
#define BLE_ISO2TXLEN_WIDTH  ((uint32_t)0x00000008)

#define BLE_ISO2RXLEN_RST    0x0
#define BLE_ISO2TXLEN_RST    0x0

__INLINE void ble_isotrcntl2_pack(uint8_t iso2rxlen, uint8_t iso2txlen)
{
    ASSERT_ERR((((uint32_t)iso2rxlen << 16) & ~((uint32_t)0x00FF0000)) == 0);
    ASSERT_ERR((((uint32_t)iso2txlen << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_BLE_WR(BLE_ISOTRCNTL2_ADDR,  ((uint32_t)iso2rxlen << 16) | ((uint32_t)iso2txlen << 0));
}

__INLINE void ble_isotrcntl2_unpack(uint8_t* iso2rxlen, uint8_t* iso2txlen)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOTRCNTL2_ADDR);

    *iso2rxlen = (localVal & ((uint32_t)0x00FF0000)) >> 16;
    *iso2txlen = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t ble_iso2rxlen_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOTRCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x00FF0000)) >> 16);
}

__INLINE void ble_iso2rxlen_setf(uint8_t iso2rxlen)
{
    ASSERT_ERR((((uint32_t)iso2rxlen << 16) & ~((uint32_t)0x00FF0000)) == 0);
    REG_BLE_WR(BLE_ISOTRCNTL2_ADDR, (REG_BLE_RD(BLE_ISOTRCNTL2_ADDR) & ~((uint32_t)0x00FF0000)) | ((uint32_t)iso2rxlen << 16));
}

__INLINE uint8_t ble_iso2txlen_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOTRCNTL2_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void ble_iso2txlen_setf(uint8_t iso2txlen)
{
    ASSERT_ERR((((uint32_t)iso2txlen << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_BLE_WR(BLE_ISOTRCNTL2_ADDR, (REG_BLE_RD(BLE_ISOTRCNTL2_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)iso2txlen << 0));
}

/**
 * @brief ISOEVTCNTOFFSETL2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:00     EVT_CNT_OFFSETL2   0x0
 * </pre>
 */
#define BLE_ISOEVTCNTOFFSETL2_ADDR   0x008101A4
#define BLE_ISOEVTCNTOFFSETL2_OFFSET 0x000001A4
#define BLE_ISOEVTCNTOFFSETL2_INDEX  0x00000069
#define BLE_ISOEVTCNTOFFSETL2_RESET  0x00000000

__INLINE uint32_t ble_isoevtcntoffsetl2_get(void)
{
    return REG_BLE_RD(BLE_ISOEVTCNTOFFSETL2_ADDR);
}

__INLINE void ble_isoevtcntoffsetl2_set(uint32_t value)
{
    REG_BLE_WR(BLE_ISOEVTCNTOFFSETL2_ADDR, value);
}

// field definitions
#define BLE_EVT_CNT_OFFSETL2_MASK   ((uint32_t)0xFFFFFFFF)
#define BLE_EVT_CNT_OFFSETL2_LSB    0
#define BLE_EVT_CNT_OFFSETL2_WIDTH  ((uint32_t)0x00000020)

#define BLE_EVT_CNT_OFFSETL2_RST    0x0

__INLINE uint32_t ble_evt_cnt_offsetl2_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOEVTCNTOFFSETL2_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0xFFFFFFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void ble_evt_cnt_offsetl2_setf(uint32_t evtcntoffsetl2)
{
    ASSERT_ERR((((uint32_t)evtcntoffsetl2 << 0) & ~((uint32_t)0xFFFFFFFF)) == 0);
    REG_BLE_WR(BLE_ISOEVTCNTOFFSETL2_ADDR, (uint32_t)evtcntoffsetl2 << 0);
}

/**
 * @brief ISOEVTCNTOFFSETU2 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  06:00     EVT_CNT_OFFSETU2   0x0
 * </pre>
 */
#define BLE_ISOEVTCNTOFFSETU2_ADDR   0x008101A8
#define BLE_ISOEVTCNTOFFSETU2_OFFSET 0x000001A8
#define BLE_ISOEVTCNTOFFSETU2_INDEX  0x0000006A
#define BLE_ISOEVTCNTOFFSETU2_RESET  0x00000000

__INLINE uint32_t ble_isoevtcntoffsetu2_get(void)
{
    return REG_BLE_RD(BLE_ISOEVTCNTOFFSETU2_ADDR);
}

__INLINE void ble_isoevtcntoffsetu2_set(uint32_t value)
{
    REG_BLE_WR(BLE_ISOEVTCNTOFFSETU2_ADDR, value);
}

// field definitions
#define BLE_EVT_CNT_OFFSETU2_MASK   ((uint32_t)0x0000007F)
#define BLE_EVT_CNT_OFFSETU2_LSB    0
#define BLE_EVT_CNT_OFFSETU2_WIDTH  ((uint32_t)0x00000007)

#define BLE_EVT_CNT_OFFSETU2_RST    0x0

__INLINE uint8_t ble_evt_cnt_offsetu2_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_ISOEVTCNTOFFSETU2_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0000007F)) == 0);
    return (localVal >> 0);
}

__INLINE void ble_evt_cnt_offsetu2_setf(uint8_t evtcntoffsetu2)
{
    ASSERT_ERR((((uint32_t)evtcntoffsetu2 << 0) & ~((uint32_t)0x0000007F)) == 0);
    REG_BLE_WR(BLE_ISOEVTCNTOFFSETU2_ADDR, (uint32_t)evtcntoffsetu2 << 0);
}

/**
 * @brief BLEPRIOSCHARB register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     15          BLEPRIOMODE   0
 *  07:00            BLEMARGIN   0x0
 * </pre>
 */
#define BLE_BLEPRIOSCHARB_ADDR   0x00810190
#define BLE_BLEPRIOSCHARB_OFFSET 0x00000190
#define BLE_BLEPRIOSCHARB_INDEX  0x00000064
#define BLE_BLEPRIOSCHARB_RESET  0x00000000

__INLINE uint32_t ble_bleprioscharb_get(void)
{
    return REG_BLE_RD(BLE_BLEPRIOSCHARB_ADDR);
}

__INLINE void ble_bleprioscharb_set(uint32_t value)
{
    REG_BLE_WR(BLE_BLEPRIOSCHARB_ADDR, value);
}

// field definitions
#define BLE_BLEPRIOMODE_BIT    ((uint32_t)0x00008000)
#define BLE_BLEPRIOMODE_POS    15
#define BLE_BLEMARGIN_MASK     ((uint32_t)0x000000FF)
#define BLE_BLEMARGIN_LSB      0
#define BLE_BLEMARGIN_WIDTH    ((uint32_t)0x00000008)

#define BLE_BLEPRIOMODE_RST    0x0
#define BLE_BLEMARGIN_RST      0x0

__INLINE void ble_bleprioscharb_pack(uint8_t blepriomode, uint8_t blemargin)
{
    ASSERT_ERR((((uint32_t)blepriomode << 15) & ~((uint32_t)0x00008000)) == 0);
    ASSERT_ERR((((uint32_t)blemargin << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_BLE_WR(BLE_BLEPRIOSCHARB_ADDR,  ((uint32_t)blepriomode << 15) | ((uint32_t)blemargin << 0));
}

__INLINE void ble_bleprioscharb_unpack(uint8_t* blepriomode, uint8_t* blemargin)
{
    uint32_t localVal = REG_BLE_RD(BLE_BLEPRIOSCHARB_ADDR);

    *blepriomode = (localVal & ((uint32_t)0x00008000)) >> 15;
    *blemargin = (localVal & ((uint32_t)0x000000FF)) >> 0;
}

__INLINE uint8_t ble_blepriomode_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_BLEPRIOSCHARB_ADDR);
    return ((localVal & ((uint32_t)0x00008000)) >> 15);
}

__INLINE void ble_blepriomode_setf(uint8_t blepriomode)
{
    ASSERT_ERR((((uint32_t)blepriomode << 15) & ~((uint32_t)0x00008000)) == 0);
    REG_BLE_WR(BLE_BLEPRIOSCHARB_ADDR, (REG_BLE_RD(BLE_BLEPRIOSCHARB_ADDR) & ~((uint32_t)0x00008000)) | ((uint32_t)blepriomode << 15));
}

__INLINE uint8_t ble_blemargin_getf(void)
{
    uint32_t localVal = REG_BLE_RD(BLE_BLEPRIOSCHARB_ADDR);
    return ((localVal & ((uint32_t)0x000000FF)) >> 0);
}

__INLINE void ble_blemargin_setf(uint8_t blemargin)
{
    ASSERT_ERR((((uint32_t)blemargin << 0) & ~((uint32_t)0x000000FF)) == 0);
    REG_BLE_WR(BLE_BLEPRIOSCHARB_ADDR, (REG_BLE_RD(BLE_BLEPRIOSCHARB_ADDR) & ~((uint32_t)0x000000FF)) | ((uint32_t)blemargin << 0));
}


#endif // _REG_BLECORE_H_

